//=======================================
//|ファイル名	main.h					|
//|-------------------------------------|
//|科目担当		佐々木 遼太 先生		|
//|-------------------------------------|
//|クラス記号	AT_12D_192				|
//|出席番号		47						|
//|学籍番号		00616					|
//|制作者		室谷 イアン				|
//|-------------------------------------|
//|担任			水貝 純	先生			|
//=======================================

//===== インクルードガード =====
#pragma once

//===== インクルード部 =====
#include <string>
#include <fstream>				//ファイル入出力
#include <crtdbg.h>				//メモリリーク検出
#include <tchar.h>				//Unicode対応
#include <Windows.h>			//WinAPI
#include <iostream>				//標準入出力

//===== 定数・マクロ定義 =====
#ifdef _DEBUG
#define DBG_NEW new (_NORMAL_BLOCK, __FILE__, __LINE__)
#else
#define DBG_NEW new
#endif // _DEBUG

//===== クラス定義 =====
//===== プロトタイプ宣言 =====
//===== グローバル定数宣言 =====
//===== グローバル変数宣言 =====
